[
{"id": 0, "name": "Borscht (Borsch)", "category": "Vegetable Soup", "rating": "4.3", "description": "The iconic borsch is probably the most famous Ukrainian dish, also considered the country's national dish. It is a comforting soup made with beetroot, meat or bone stock, and sautéed vegetables. There are many variations - the broth can be made with beef, pork, chicken, or as a vegetarian version.The soup often includes fermented beetroot juice (kvas), and it is common to add meat, while typical vegetables include root vegetables and cabbage. The essential ingredient in every borsch is beetroot. It gives the dish its distinctive red color and a characteristic earthy flavor.The exact origin of this classic is difficult to trace – although it is predominately associated with Ukraine, as the country boasts the largest number of borsch varieties. Regardless of its origins, it is one of the favorite dishes across Central and Eastern Europe.  Read more For example, in Poland, there are several varieties, but the most popular version is barczsz with dumplings, which is served as a traditional Christmas Eve dish. Due to migration, the tradition of preparing borsch has long ago surpassed European borders, and is commonly found in Ukrainian restaurants across the world.In Ukraine, the dish is often served with savory yeasted buns called pampushki."},
{"id": 1, "name": "Varenyky", "category": "Dumplings", "rating": "4.5", "description": "Originating from the historical region of Red Ruthenia, these soft, crescent-shaped dumplings are filled with a combination of potatoes and cheese, which is occasionally modified with various seasonings or fried onions. Pierogi ruskie are usually boiled and shortly fried until they develop a crispy texture.The dumplings are often served sprinkled with cracklings, crispy fried onions, or bacon, and can be enjoyed as a hearty appetizer or as a main course. In Ukraine, the pierogis are called varenyky, and they are so popular that there is even a monument celebrating varenyky in the city of Cherkasy. The sweet, fruit-filled version of varenyky is typically served with sugar and sour cream."},
{"id": 2, "name": "Paska", "category": "Sweet Bread", "rating": "4.0", "description": "The traditional Ukrainian paska–also known as kulich in Russia–is a sweet and fragrant Easter bread. This popular delicacy abounds in eggs and butter, and typically has a tall cylindrical shape with a rounded top. It is often enriched with citrus juice or zest, vanilla, rum, ginger, and occasionally saffron.Some varieties of paska also might include raisins, candied fruit, or maraschino cherries. In the past, the surface of the bread was commonly decorated with festive ornaments, usually roses or crosses, but modern versions are often brightened with pristine egg-white glaze, colorful sprinkles, or poppy seeds.Outside Ukraine and Russia, this type of bread is also commonly consumed in Georgia, Bulgaria, Romania, Serbia, and Slovakia. Paska is usually taken to church on Easter morning, where it is blessed, and later shared at home among family members."},
{"id": 3, "name": "Chicken Kyiv (Kotleta po Kyivsky)", "category": "Fried Chicken Dish", "rating": "4.3", "description": "Chicken Kyiv consists of a boned, flattened chicken breast that is rolled around chilled herb butter, breaded, and then fried. Although the dish is very popular, no one knows where it came from or how it got its name, and there are numerous contradicting theories attributing its invention to Ukrainian, Russian, and French chefs.It was at the height of its popularity in the 1970s, but quickly fell out of favor in the late 1980s with the rise of nouvelle cuisine. Interestingly, in Soviet hotels’ tourist brochures, guests were warned of the dangers of splattering themselves with hot butter."},
{"id": 4, "name": "Kutia", "category": "Pudding", "rating": "3.4", "description": "Kutia is a Ukrainian, Russian, Belarusian, and Polish sweet grain pudding that is traditionally served as part of a twelve-meal Christmas Eve supper. Interestingly enough, this festive treat is believed to have existed long before Christianity.It is made with wheat, berries, honey or sugar, nuts, raisins, and poppy seeds. On Christmas Eve, before consuming the dish, a small bowl of kutia is traditionally placed outdoors as a bribe to Father Frost, then some of the kutia is tossed to the ceiling, and the number of grains that stick to the ceiling are used to predict next year's agricultural prosperity."},
{"id": 5, "name": "Bublik", "category": "Sweet Bread", "rating": "4.1", "description": "Bublik is a name that is commonly used in Eastern European countries, predominately Ukraine and Russia, when referring to a round, yeasted bun, in many ways similar to a bagel. Before baking, it is shortly poached in water and dusted with poppy seeds, sesame, or sugar.It is believed that bublik was created among the Jewish population in czarist Russia, but got its present form in Ukraine. It was originally sold from street carts, where it was lined on a string and offered to the customers. Bublik is typically consumed as a snack or as an accompaniment to coffee or tea.In Europe, there are numerous bread products resembling bublik, such as the Polish obwarzanek and Russian baranki."},
{"id": 6, "name": "Syrnyky", "category": "Pancake", "rating": "4.5", "description": "Syrniki is a dessert consisting of fried cottage cheese pancakes that are usually garnished with honey, fruit jam, sour cream, or applesauce. It is part of the Russian (where it's sometimes also called tvorozhniki), Belarusian, Ukrainian, Latvian and Lithuanian cuisine.Cottage cheese is traditionally first swetened with sugar, then combined with flour into a dough which is fried in hot oil until it develops a golden-brown color. Syrniki can be served for breakfast or consumed as a tasty dessert after a large meal."},
{"id": 7, "name": "Pampushka", "category": "Bread", "rating": "4.4", "description": "Pampushki are small Ukrainian yeasted buns. They can be prepared in sweet or savory versions. The dough usually consists of milk, flour, eggs, sugar, butter, yeast, oil, and salt, and it is then shaped into small balls. The sweet version is often stuffed with ingredients such as fruit jam, berries, fresh fruit, or cottage cheese, while the savory ones have no filling, but are traditionally flavored with garlic sauce and served alongside borscht."},
{"id": 8, "name": "Kyiv Cake (Kyivski tort)", "category": "Cake", "rating": "4.1", "description": "Kyivski tort is a traditional Soviet cake originating from Kyiv, the capital of Ukraine. Instead of common sponge cake, kyivski tort contains a nutty meringue with a crunchy and airy texture, a technique which was created in 1956 at the Karl Marx Confectionery Factory.Although walnuts were initially used for the meringue, they were later replaced with cashews, and then hazelnuts. The layers of nutty meringue are combined with a sweet vanilla and chocolate buttercream. The cake is usually sprinkled with chopped hazelnuts and left to cool before serving, so that the cream develops a silky, mousse-like texture.Due to the long process of preparation, this cake is usually served on special occasions."},
{"id": 9, "name": "Sorrel Soup (Shchavel Borsch)", "category": "Vegetable Soup", "rating": "3.9", "description": "Sorrel soup or green borscht is a hearty, sour-flavored Ukrainian soup made with sorrel leaves, stock, butter, onions, sugar, lemon juice, sour cream, and beaten egg yolks. The soup is also popular in Russia and Belarus, and it can be served warm or chilled.Today, there are numerous versions of the soup throughout Eastern Europe, so cooks add different ingredients into it, such as spinach, carrots, potatoes, or beetroot. Serve green borscht with a dollop of sour cream and a slice of rye bread."},
{"id": 10, "name": "Korovai", "category": "Bread", "rating": "3.8", "description": "Korovai is a traditional Ukrainian wedding bread that is also popular in countries such as Poland, Bulgaria, Romania, and Russia. Instead of a cake, Ukrainians bake this massive, lavishly decorated bread that is often made by seven married women from seven different places.Participation of widows in the bread-making process is forbidden, since it is believed that a piece of their fate will be forwarded to the prospective couple. There are many superstitions and rituals connected to korovai – for example, if the bread cracks in the oven, the marriage will be doomed.After the wedding ceremony, korovai is cut and shared among guests."},
{"id": 11, "name": "Koliva", "category": "Porridge", "rating": "3.6", "description": "Koliva is a traditional dish consisting of a combination of any of the following ingredients: boiled wheat kernels, honey, sugar, sesame seeds, walnuts, raisins, anise, almonds, and pomegranate seeds. In the Orthodox Christian religion, it is used as a ritual dish that is prepared for funerals, memorials, Lent, Slava, or Christmas, since it symbolizes death and resurrection.This unique porridge is traditionally served with powdered sugar on top, while it is customary to stick a candle in the center and light it at the beginning of the service, then extinguish it at the end."},
{"id": 12, "name": "Deruny", "category": "Pancake", "rating": "4.1", "description": "Deruny are classic Ukrainian potato pancakes made with finely grated potatoes, onions, eggs, flour, and sour cream. Once prepared, the batter is fried in a pan, resulting in small pancakes with a soft and moist interior and a slightly brown exterior.Deruny are traditionally served hot, paired with a dollop of sour cream. There are many versions of these pancakes, with added ingredients such as ground meat, mushrooms, or cabbage."},
{"id": 13, "name": "Banosh", "category": "Porridge", "rating": "4.0", "description": "Traditionally prepared over an open fire, this velvety Ukrainian corn porridge originated in the Carpathian highlands. It consists of corn flour cooked in a mixture of sour cream and Bryndza cheese. In the past, it was associated exclusively with the Hutsul minority, where the task of preparing the dish was reserved for men.Today, the dish is an indispensable part of traditional Ukrainian cuisine and it is commonly consumed throughout the country. Found on menus of most traditional restaurants, it usually comes served with fried bacon bits, crumbled Bryndza, mushroom sauce, or crispy cracklings."},
{"id": 14, "name": "Buckwheat Patties (Hrechanyky)", "category": "Ground Meat Dish", "rating": "4.4", "description": "Hrechanyky are traditional Ukrainian patties that are especially popular in the region of Lemko. The patties are usually made with a combination of ground meat (beef, chicken, or pork), boiled buckwheat, eggs, onions, flour, breadcrumbs, coriander, sunflower oil, salt, and pepper.The onions are chopped and sautéed in oil, and then mixed with the ground meat, eggs, breadcrumbs, coriander, and seasonings. The mixture is shaped into patties that are rolled in flour and fried in oil on both sides until golden brown. The patties are then baked in the oven, usually with a sauce based on tomatoes, mushrooms, or sour cream.Hrechanyky are served with stewed or raw vegetables."},
{"id": 15, "name": "Kruchenyky", "category": "Meat Dish", "rating": "4.1", "description": "Kruchenyky (also known as zavyvantsi) is a traditional Ukrainian dish consisting of stuffed meat rolls. Pork is the most common type of meat used for kruchenyky, but beef, chicken, or even fish can be used instead of it. The stuffings vary from region to region, and some of the most common ingredients for the stuffing include mushrooms, carrots, onions, cheese, cabbage, and prunes.These rolls are typically topped with sour cream and baked in the oven, then served hot as an appetizer, although kruchenyky can also be served cold."},
{"id": 16, "name": "Perepichka", "category": "Savory Pastry", "rating": "4.2", "description": "Perepichka is an iconic Ukrainian street food item consisting of a soft, not overly seasoned sausage that is enclosed within yeasted dough. The whole combination is deep-fried, and it is usually served piping hot without any condiments. The first version of this favorite Kyiv street food appeared in 1981 at a small kiosk on Bohdan Khmelnytsky street.Perepichka was an instant success, and this hole-in-the-wall food outlet became somewhat of an institution for both locals and tourists."},
{"id": 17, "name": "Verhuny", "category": "Sweet Pastry", "rating": "4.5", "description": "Verhuny is a traditional pastry originating from Ukraine. The pastry is usually made with a combination of flour, baking soda, butter, eggs, sugar, white wine vinegar, sour cream, vodka, oil, salt, and lard. The flour is mixed with baking soda, butter, eggs, sugar, vinegar, sour cream, vodka, and salt in order to get a firm dough.The dough is rolled thinly and sliced diagonally to get a diamond shape. A slash is made in the center of each diamond, and one end of the dough is pulled through the opening. Verhuny are then fried in lard until golden and drained on paper towels.Before serving, the pastries are often sprinkled with sugar."},
{"id": 18, "name": "Machanka", "category": "Stew", "rating": "3.8", "description": "Machanka is a Belarusian and Ukrainian stew made with a combination of pork, sour cream, flour, and beef stock. The meat can include bacon, sausages, or ham, all cut into very small pieces. This soup-like stew is typically enriched with onions, mushrooms, and dill.Quite commonly, machanka is served with draniki pancakes, consisting of potatoes, flour, lard, and salt, and some claim that the proper way to consume machanka is to roll up the potato pancakes and dip them into the stew."},
{"id": 19, "name": "Nachynka", "category": "Casserole", "rating": "No rating", "description": "Nachynka is a traditional dish originating from Ukraine. This cornmeal casserole is usually made with a combination of onions, butter, cornmeal, sugar, salt, milk, eggs, and baking powder. The onions are sautéed in butter, then mixed with salt, sugar, and milk.The dish is stirred until thick, and it is then mixed with the eggs and baking powder and stirred again. The mixture is poured into a casserole dish and baked in the oven for about an hour or until the mixture puffs up and becomes golden brown."},
{"id": 20, "name": "White Mushrooms à la Hutsul", "category": "Casserole", "rating": "No rating", "description": "White mushrooms à la Hutsul is a traditional Ukrainian dish originating from the western parts of the country. The dish is usually made with a combination of white mushrooms, onions, butter, cream, flour, hard cheese, salt, and pepper. The mushrooms are boiled and cut into smaller pieces.The onions are chopped and fried in butter until golden. The mushrooms are added to the pan, the mixture is seasoned with salt and pepper, and it's fried for a few more minutes. The mushroom-onion mixture is placed into a clay or ceramic pot and it's covered with a sauce consisting of flour, butter, and cream.Hard cheese is grated over the top and the dish is then baked in the oven until the cheese melts and the top is bubbling."},
{"id": 21, "name": "Mazuryky", "category": "Turkey Dish", "rating": "No rating", "description": "Mazuryky are traditional Ukrainian sausage-shaped meat patties that are especially popular in Volyn and northwestern Ukraine. They're usually made with a combination of ground turkey meat, cheese, eggs, butter, milk, garlic, flour, salt, and pepper.The ground meat is mixed with grated cheese, milk, eggs, butter, salt, and pepper. The mixture is shaped into small sausages that are rolled in flour and fried in butter until golden and fully cooked. Once done, mazuryky are sprinkled with finely chopped garlic and served hot, typically with boiled potatoes or potato pancakes (deruny) as accompaniments."},
{"id": 22, "name": "Shukhy", "category": "Side Dish", "rating": "No rating", "description": "Shukhy is a traditional Christmas dish originating from western Ukraine, where it's often cooked by Hutsul highlanders. The dish is usually made with a combination of wild mushrooms, beetroot, rapeseed oil, shallots, red wine vinegar, garlic, oregano, salt, and pepper.The beetroot is boiled until tender, drained, cooled, cut into slices, and then into strips. The shallots are sautéed in oil over low heat and then mixed with the soaked mushrooms, vinegar, and garlic. The mixture is taken off the heat and seasoned with salt and pepper.The onions and mushrooms are mixed with the beets, cooled, and garnished with oregano before serving. Shukhy is typically served cold as part of a Christmas feast."},
{"id": 23, "name": "Kalatusha", "category": "Soup", "rating": "No rating", "description": "Kalatusha is a traditional Ukrainian soup originating from Polissya. The soup is usually made with a combination of mushrooms, fish such as carp, flour, butter, oil, roasted vegetables (such as beets, carrots, celery, tomatoes, onions), allspice, bay leaves, dill, parsley, salt, and pepper.The vegetables (carrots, celery, onions, beets, and tomatoes) are roasted in the oven. The carp is cut into pieces and mixed with mushrooms, bay leaves, dill, parsley, and allspice. The mixture is cooked in order to create a broth that is then strained through a sieve.A mixture of flour and butter is added to the broth for thickening, along with the roasted vegetables. The carrots and celery are puréed and then mixed with the broth in order to create a thick soup that's served with the mushrooms and pieces of fish on top."},
{"id": 24, "name": "Gamula", "category": "Dessert", "rating": "No rating", "description": "Gamula is a traditional Ukrainian dessert that's usually made in autumn. The dessert is made with a combination of flour, honey, and soft and beaten apples that can't be stored in cellars. The apples are baked in the oven, cooled, and puréed.The purée is mixed with flour (or flour and oatmeal) and honey. The mixture is then placed in an ovenproof dish and baked in the oven on low heat until a crust forms at the top and the dessert becomes golden brown. Once done, apple gamula is typically served with a cup of tea on the side."},
{"id": 25, "name": "Komes", "category": "Potato Dish", "rating": "No rating", "description": "Komes is a traditional side dish originating from Ukraine. These potato balls are made with a combination of boiled, skinned, and mashed potatoes, onions, salted pork or bacon, salt, and pork fat. The chopped onions are cooked in pork fat until golden, and they are then mixed with the potatoes.The mixture is shaped into walnut-sized balls, then fried until brown on all sides. The salt is added if needed, as the salt pork or bacon may provide enough seasoning. These potato balls are usually served as an accompaniment to meat dishes, but they can also be served on their own with a salad for a light meal."},
{"id": 26, "name": "Tovchanka", "category": "Potato Dish", "rating": "No rating", "description": "Tovchanka is a traditional Ukrainian side dish originating from the Ternopil region. The dish is usually made with a combination of potatoes, beans, poppy seeds, onions, sugar, salt, and pepper. The beans are soaked in water and boiled until tender.The potatoes are peeled, cut, boiled in salted water, and added to the beans. The poppy seeds are soaked in warm water, ground, and added to the potatoes and beans. The mixture is enriched with finely chopped onions, sugar, salt, and pepper. It is pounded and mashed until everything is well-blended.If the dish is thick, a bit of leftover cooking water from the potatoes can be added to make it a bit thinner. "},
{"id": 27, "name": "Kherson-Style Eggplants", "category": "Appetizer", "rating": "No rating", "description": "Kherson-style eggplants is a traditional Ukrainian dish originating from Kherson, a region with abundant eggplants. The dish is usually made with a combination of eggplants, tomatoes, bell peppers, onions, garlic, lemon juice, sunflower oil, sugar, salt, and black pepper.The vegetables are washed and peeled. The eggplants and bell peppers are cut in half and roasted in the oven, while the tomatoes are blanched and cut into cubes. The eggplants, bell peppers, and tomatoes are mixed with garlic, grated onions, lemon juice, oil, and seasonings.The mixture is stirred until smooth, and it's then typically served as an appetizer with bread or croutons."},
{"id": 28, "name": "Sauerkraut with Peas (Kvashena kapusta z horokhom)", "category": "Side Dish", "rating": "No rating", "description": "Kvashena kapusta z horokhom is a traditional dish originating from Ukraine. It’s usually made with a combination of sauerkraut, bacon, onions, flour, peas, mushrooms, garlic, sour cream, salt, and black pepper. The sauerkraut is boiled for half an hour and drained.The bacon pieces are browned in a skillet and mixed with the onions. The mixture is sprinkled with flour and sauerkraut liquid, and the mixture is stirred until the sauce is thick. The sauerkraut, peas, mushrooms, and garlic are added to the pot, and the dish is simmered until thick.It’s taken off the heat and mixed with sour cream and seasonings, and kvashena kapusta z horokhom is then served immediately. The dish is typically served as an accompaniment to meat dishes, especially pork."},
{"id": 29, "name": "Hutsul varya", "category": "Salad", "rating": "No rating", "description": "Hutsul varya is a traditional Ukrainian salad originating from Bukovyna. The salad is usually made with a combination of beets, prunes, sauerkraut, onions, white beans, oil, salt, and black pepper. The beets are baked or boiled, peeled, grated, and cut into cubes.The beans are soaked in water and boiled until tender. The prunes are soaked in hot water and cut into strips, while the onions are cut into half-rings. The ingredients are then simply mixed in a bowl, seasoned with salt and pepper, and drizzled with oil before serving.Hutsul varya is especially popular during Lent because it doesn't contain any meat or animal products."}
]